import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-company-aditional-info-page',
  templateUrl: './company-aditional-info-page.component.html',
  styleUrls: ['./company-aditional-info-page.component.css'],
})
export class CompanyAditionalInfoPageComponent implements OnInit {
  constructor() {}

  ngOnInit(): void {}

  //   категорију предузећа (продавница или угоститељски објекат);
  //  шифра делатности (може их бити и више, узимају се из шифарника);
  //  да ли је предузеће у систему ПДВ или није – поље за потврду;
  //  пословне жиро рачуне (број рачуна и банку код које је рачун регистрован);
  // свако предузеће може имати више жиро рачуна; број жиро рачуна је увек у
  // следећем формату: [3_цифре]-[12_цифара]-[2_цифре].
  //  број магацина који жели да има (подразумевано 1); сваки магацин мора имати
  // свој јединствени идентификатор и назив;
  //  број фискалних каса које поседује у објектима свог предузећа (подразумевано
  // 1); за сваку касу предузеће треба да унесе локацију објекта и тип касе (бира
  // се из падајуће листе од неколико модела).

  category: string;
  code: string;
  pdv: boolean;
}
